
// 聊天数据
class StoryData {
  // id
  var id;

  // 头像
  String image;

  // 主标题
  String title;

  // 副标题
  String subTitle;

  // 描述
  String description;

  // 图集
  List imageList;

  StoryData( this.id,  this.image, this.title, this.subTitle , this.description, this.imageList);

}

List<StoryData> storyData = [
  new StoryData(
    1,
    'images/story/01/cover.jpg',
    'episode.1',
    'プロローグ',
    '因为黑沼爽子的外表看起来很阴沉,所以大家给她取了个“贞子”的外号,对想跟大家打成一片的爽子来说,个性开朗活泼又是大家中心人物的风早翔太就成了爽子心中憧憬的对象。在结业式前,爽子心中憧憬的对象风早约了爽子参加试胆大会。',
    [
      'images/story/01/01.jpg',
      'images/story/01/02.jpg',
      'images/story/01/03.jpg',
      'images/story/01/04.jpg',
      'images/story/01/05.jpg',
      'images/story/01/06.jpg',
    ]
  ),
  new StoryData(
    2,
    'images/story/02/cover.jpg',
    'episode.2',
    '席替え',
    '在大雨中淋的全身湿透的爽子到了学校,看到她这幅模样的同学们都感到无比的害怕,但是却因为这个机会,让爽子和吉田千鹤,矢野有了说话的机会,而爽子也很感谢风早很温柔的对待她。爽子也决定要趁这次换座位的机会下定决心要和坐在隔壁的同学好好相处,可是…。',
    [
      'images/story/02/01.jpg',
      'images/story/02/02.jpg',
      'images/story/02/03.jpg',
      'images/story/02/04.jpg',
      'images/story/02/05.jpg',
    ]
  ),
  new StoryData(
    3,
    'images/story/03/cover.jpg',
    'episode.3',
    '放课後',
    '终於可以和自己憧憬的同学自然的说早安。正当爽子正在为这件事感动的时候,这学期代理班导的副班导荒井一市(通称:阿瓶)登场了,阿瓶正想要擅自决定谁来制作出席簿时,不想看到大家困扰的爽子就举起了手…。',
    []
  ),
  new StoryData(
    4,
    'images/story/04/cover.jpg',
    'episode.4',
    '噂',
    '因为千鹤和矢野的关系,爽子终于再次尝到幸福的滋味。可是在学校中突然开始传出中伤千鹤和矢野的流言。虽然千鹤和矢野一开始听到传出谣言的人是爽子的时候是一笑置之不太相信,可是…。',
    []
  ),
  new StoryData(
    5,
    'images/story/05/cover.jpg',
    'episode.5',
    '决意',
    '爽子以为千鹤和矢野的流言是因为自己的关系,而感到自责,所以为了不要再让千鹤和矢野受到伤害,决定回到独来独往的自己,而且也和风早保持距离以免风早也受到牵连。但是千鹤和矢野却被爽子突然冷漠的态度感到迷惘,一直拚命想找出答案。而风早则为了确定爽子的心意决定直接找上爽子…。',
    []
  ),
  new StoryData(
    6,
    'images/story/06/cover.jpg',
    'episode.6',
    '友達',
    '爽子无意间在女生厕所内听到同年级的在谈论千鹤和矢野的谣言,爽子为了要澄清误会,却引起了大騒动,连爽子的同班同学们也都说谣言是爽子传的,但是却遭到风早强烈的否定。就在这个时候千鹤和矢野登场了…。',
    []
  ),
  new StoryData(
    7,
    'images/story/07/cover.jpg',
    'episode.7',
    '土曜の夜',
    '因为千鹤和矢野的邀约,爽子就和千鹤,矢野三个人一起要去吃拉面。她们要去吃的那家拉面店就是同班同学真田龙家开的。三个人在吃完拉面后,千鹤就带着矢野和爽子跑去阿龙的房间玩…。',
    []
  ),
  new StoryData(
    8,
    'images/story/08/cover.jpg',
    'episode.8',
    '自主練習',
    '班上同学告诉爽子有关她的新传闻,竟然跟以前相反,变成了“让爽子笑,就可以得到福气”。虽然爽子很认真的想笑,却一直无法顺利…。另一方面,为了准备即将举行的体育祭,大家也因风早是1年D班的执行委员,而开始认真练习…。',
    []
  ),
  new StoryData(
    9,
    'images/story/09/cover.jpg',
    'episode.9',
    '新しい友達',
    '正沉浸在幸福中的爽子,遇到了同年级的胡桃,胡桃可爱的外型成了爽子憧憬的对象,也因为被自己的偶像胡桃称赞长的像娃娃一样,心中更是感动,就想像着自己的发型要变得跟偶像一样,于是去找千鹤她们商量…。',
    []
  ),
  new StoryData(
    10,
    'images/story/10/cover.jpg',
    'episode.10',
    '協力',
    '爽子和胡桃变成好朋友了? 好几次胡桃总是亲切地向爽子打招呼,而爽子也会生硬地回应,然而每当千鹤和小彩看到这副光景时却感到有点错愕。就在这个时候爽子向可以和风早自然交谈的胡桃说出心中的烦恼,可是……',
      []
  ),
  new StoryData(
    11,
    'images/story/11/cover.jpg',
    'episode.11',
    'とくべつ?',
    '胡桃对爽子说出自己想和单恋已久的风早交往,并且希望爽子可以助她一臂之力。可是因为爽子察觉到风早对自己来说是个特别的存在,所以回绝了胡桃,听完这番话后,胡桃渐渐开始露出了她的本性。',
      []
  ),
  new StoryData(
    12,
    'images/story/12/cover.jpg',
    'episode.12',
    '恋爱情愫?',
    '爽子和胡桃一起去为风早的垒球比赛加油时经由聊天,才了解到胡桃从中学的时候就开始喜欢着风早,爽子这才体认到自己对风早的事情一无所知,於是胡桃就建议爽子应该要先确认清楚自己的感觉比较好。',
      []
  ),
  new StoryData(
    13,
    'images/story/13/cover.jpg',
    'episode.13',
    '恋',
    '当爽子和阿龙两人单独谈话的画面映入眼帘时，风早不禁醋意涌上心头，压抑不住冲动拉着爽子的手跑开。那一瞬间爽子强烈地希望自己心中难解的情愫就是“恋爱”…而风早则在爽子心中潮涌时问她：“你喜欢阿龙吗?”',
      []
  ),
  new StoryData(
    14,
    'images/story/14/cover.jpg',
    'episode.14',
    'くるみ',
    '当千鹤和小彩告诉爽子，之前那些中伤她的流言的造谣者就是胡桃时，爽子还是选择相信胡桃，但是胡桃毫不讳言自己就是始作俑者，并说她从来没把爽子当成朋友…',
      []
  ),
  new StoryData(
    15,
    'images/story/15/cover.jpg',
    'episode.15',
    'ライバル',
    '看着胡桃泪流满面的模样，爽子也不禁哭了起来，两个人边哭边诉说着风早的种种。爽子对胡桃能向她开诚布公地说出对风早的感情，感到非常的高兴。而胡桃也藉此跟爽子说自己被风早误会喜欢阿瓶的事。',
      []
  ),
  new StoryData(
    16,
    'images/story/16/cover.jpg',
    'episode.16',
    '夜噺',
    '总集篇',
      []
  ),
  new StoryData(
    17,
    'images/story/17/cover.jpg',
    'episode.17',
    '休日',
    '知道千鹤和矢野要来家中做客，爽子一大早就雀跃不已，精心做了蛋糕和许多事前准备，为的就是迎接千鹤和矢野的来访。三个女孩在爽子的房间里有说有笑谈天说地时，风早打来了电话…',
      []
  ),
  new StoryData(
    18,
    'images/story/18/cover.jpg',
    'episode.18',
    '千鹤の恋',
    '爽子看着千鹤和阿龙之间相处融洽的模样，不禁在心中惴想两人或许彼此情投意合。就在陪千鹤去买阿龙的生日礼物时，爽子提起勇气，决定要直接了当地问出千鹤心中所属何人...',
      []
  ),
  new StoryData(
    19,
    'images/story/19/cover.jpg',
    'episode.19',
    '夢',
    '爽子和彩音相约要到千鹤家过夜的当天早上，阿龙对千鹤说“明天和后天绝对别来我家”，因为这句话而气愤难消的千鹤，听从彩音的建议，拿阿龙的生日礼物去他家一探究竟，正好碰上彻──阿龙的哥哥返家归来…。',
      []
  ),
  new StoryData(
    20,
    'images/story/20/cover.jpg',
    'episode.20',
    'プレゼント',
    '千鹤听到自己长久单相思的对象─彻要结婚的消息时，尽管难掩心中的震惊和难过，为了要把未及送出的生日礼物交给阿龙，还是去了他家。然后意外出现的阿龙点明了彻已经离开，并且向千鹤开诚布公表白自己的情感……',
      []
  ),
  new StoryData(
    21,
    'images/story/21/cover.jpg',
    'episode.21',
    '初雪',
    '与阿龙大吵一架的翌日，千鹤心情豁然开朗，于是约了爽子和彩音一起去KTV痛快飙歌。结束后，本来想去阿龙家吃拉面，千鹤想到跟阿龙才刚吵完架所以开始犹豫难决…就在这时，人应该在札幌的彻突然出现在三人面前。',
      []
  ),
  new StoryData(
    22,
    'images/story/22/cover.jpg',
    'episode.22',
    'クリスマス',
    '期末考结束后，第二学期只剩结业式便将告终。风早提议举行圣诞派对，让还没有情人的人一起共度。爽子向往期待着与朋友一起过圣誔夜，但是爽子家有个每年都要举家同庆平安夜的习惯…。',
    []
  ),
  new StoryData(
    23,
    'images/story/23/cover.jpg',
    'episode.23',
    'ふたり',
    '今天是第二学期的结业式，紧接而来的的寒假意味有好长一段时间见不到千鹤和彩音，想到此爽子不禁感到异常寂寞。这时，千鹤约了爽子除夕夜当天一起前往神社参拜；而很恰巧的，爽子的生日正是除夕夜！到底千鹤和彩音为爽子准备的生日礼物是什么呢…？',
      []
  ),
  new StoryData(
    24,
    'images/story/24/cover.jpg',
    'episode.24',
    '诞生日',
    '原本约好除夕夜当天在神社的附近会合，实际到的却不见千鹤、彩音跟阿龙，只有爽子跟风早两人相对愕然…原来千鹤和彩音早就计划好要制造两人独处的机会！虽然彼此都很腼腆，爽子跟风早还是一起去神社喝甜酒。只是没想到最爱黏着风早的阿城和家人也一起来参拜…！',
      []
  ),
  new StoryData(
    25,
    'images/story/25/cover.jpg',
    'episode.25',
    '初詣',
    '当爽子和风早两人一起参拜时，千鹤和彩音为了不让阿城从中扰乱一直绊着他。对这一切感到焦躁不已的阿龙，索性喝了甜酒就要回家。千鹤为了安抚阿龙，把阿城托给彩音後就陪阿龙一起去参拜。在迎接新年的时刻，大家都各自找到自己的归属度过了除夕。',
      []
  ),
];